/*
 * 🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️
 * 🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕
 *
 *   _                             __
 *  | |                           /_/
 *  | |     ___  ___   _ __ ___   ___  ___  __ _ _ __   __ _  ___  ___
 *  | |    / _ \/ __| | '_ ` _ \ / _ \/ __|/ _` | '_ \ / _` |/ _ \/ __|
 *  | |___|  __/\__ \ | | | | | |  __/\__ \ (_| | | | | (_| |  __/\__ \
 *  |______\___||___/ |_| |_| |_|\___||___/\__,_|_| |_|\__, |\___||___/
 *                                                     __/ |
 *                                                    |___/
 *
 * 🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕
 * 👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅
 */

import fs from 'fs';
import brack0Fn from './core/brack0';
import necraidanFn from './core/necraidan';

//const isNec = !!process.argv[2];

const isNec = true;

const filenames = ['a_example.txt', /*'b_lovely_landscapes.txt',*/ 'c_memorable_moments.txt', 'd_pet_pictures.txt', 'e_shiny_selfies.txt'];
// const filenames = ['b_lovely_landscapes.txt'];

filenames.forEach((f: any, index: number) => {
  console.log('Start file ' + (index + 1));
  const lines = fs.readFileSync('in/' + f, 'utf-8').split('\n');

  fs.writeFile('out/' + f + '.out', isNec ? necraidanFn(lines) : brack0Fn(lines), err => {
    if (err) {
      return console.log(err);
    }

    console.log('The file was saved!');
  });
});
