/*
 * 🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️
 * 🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕
 *
 *   _                             __
 *  | |                           /_/
 *  | |     ___  ___   _ __ ___   ___  ___  __ _ _ __   __ _  ___  ___
 *  | |    / _ \/ __| | '_ ` _ \ / _ \/ __|/ _` | '_ \ / _` |/ _ \/ __|
 *  | |___|  __/\__ \ | | | | | |  __/\__ \ (_| | | | | (_| |  __/\__ \
 *  |______\___||___/ |_| |_| |_|\___||___/\__,_|_| |_|\__, |\___||___/
 *                                                     __/ |
 *                                                    |___/
 *
 * 🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕
 * 👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅
 */

import fs from 'fs';
import brack0Fn from './core/brack0';
import necraidanFn from './core/necraidan';

const isNec = !!process.argv[2];

const filenames = ['a_example.in'];

filenames.forEach(f => {
  const lines = fs.readFileSync('in/' + f, 'utf-8').split('\n');
  console.log(lines);
  lines.forEach(l => console.log(l.split(' ')));

  fs.writeFile('out/' + f + '.out', isNec ? necraidanFn(lines) : brack0Fn(lines), err => {
    if (err) {
      return console.log(err);
    }

    console.log('The file was saved!');
  });
});
