/*
 * 🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️🕶️
 * 🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕
 *
 *           _                    _    _______    _               _
 *     /\   | |                  | |  |__   __|  | |             | |
 *    /  \  | |_ __ ___  __ _  __| |_   _| | __ _| | _____ _ __  | |_ ___
 *   / /\ \ | | '__/ _ \/ _` |/ _` | | | | |/ _` | |/ / _ \ '_ \ | __/ __|
 *  / ____ \| | | |  __/ (_| | (_| | |_| | | (_| |   <  __/ | | || |_\__ \
 * /_/    \_\_|_|  \___|\__,_|\__,_|\__, |_|\__,_|_|\_\___|_| |_(_)__|___/
 *                                  __/ |
 *                                |___/
 *
 * 🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕🍺🍕
 * 👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅
 */

import fs from 'fs';

const filenames = ['a_example.in'];

filenames.forEach(f => {
  const lines = fs.readFileSync('in/' + f, 'utf-8').split('\n');
  console.log(lines);
  lines.forEach(l => console.log(l.split(' ')));

  fs.writeFile(
    'out/' + f + '.out',
    lines
      .map(l =>
        l
          .split(' ')
          .map(e => e * 3)
          .join(' ')
      )
      .join('\n'),
    function(err) {
      if (err) {
        return console.log(err);
      }

      console.log('The file was saved!');
    }
  );
});
